In [5]:
import pandas as pd

In [6]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

1. Display TOP3 values

In [3]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

2. Display LAST3 values

In [4]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

3. Find Shape of our Dataset (Number of rows, cols)

In [9]:
df1.shape
print("Number of rows and cols is", df1.shape[0])
print("Number of rows and cols is", df1.shape[1])

Number of rows and cols is 7
Number of rows and cols is 3

4. Get information out dataset like, total number of rows,cols, datatype of each column and memory req

In [12]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

5. Check for null Values in data set

In [14]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

6. Get Overall Statitic about the dataframe (Function describe only works on numerical values, but we can use "all" to see everything)

In [17]:
df1.describe(include="all")

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

7. Find unique values from the gender column and also find the numerical number of unique values

In [23]:
df1["Gender"].unique()

array(['Male', 'Female'], dtype=object)

In [25]:
df1["Gender"].nunique()

2

8. Display Count of Unique values in Gender Column

In [26]:
df1["Gender"].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

9. Find the total number of students with the marks 90 to 100 použitím between

In [12]:
df1[df1["Marks"].between(90,100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

10. Find average marks

In [19]:
df1["Marks"].mean()

np.float64(92.14285714285714)

12. Apply method + pridať series

In [27]:
def marks(x):
    return (x//2) # Keď je // Zaokruhlý na celé čísla

In [ ]:
df1["Half_Marks"] = df1["Marks"].apply(marks)
df1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [30]:
# Druhy spôsob jednoduchší 
df1["Half_Marks"] = df1["Marks"].apply(lambda x:x//2)
df1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [ ]:
df1["Name"].apply(len)      #Apply na dĺžku textu

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [36]:
df1["Gender_num"]= df1["Gender"].map({"Male":1, "Female":0})
df1

      Name  Marks  Gender  Half_Marks  Gender_num
0  Priyang     98    Male          49           1
1   Aadhya     89  Female          44           0
2   Krisha     99  Female          49           0
3   Vedant     87    Male          43           1
4   Parshv     90    Male          45           1
5   Mittal     83  Female          41           0
6  Archana     99  Female          49           0

13. Drop the column

In [43]:
df1.drop(["Half_Marks", "Gender_num"],axis=1, inplace=True)

14. Print the name of the column

In [44]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [45]:
df1.index

RangeIndex(start=0, stop=7, step=1)

16. Sort the dataframe as per the marks

In [ ]:
df1.sort_values(by=["Marks", "Gender"], ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

17. Display name and marks of the female students

In [55]:
df1[df1["Gender"] =="Female"] [["Name", "Marks"]] #Zobraz v df1 len df1 kde gender je Female a zobraz Name a Marks

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [ ]:
#Alebo jednoduchší spôsob
df1[df1["Gender"].isin(["Female"])]

      Name  Marks  Gender
1   Aadhya     89  Female
2   Krisha     99  Female
5   Mittal     83  Female
6  Archana     99  Female